# EdgeAnt build based on Ultralytics library

# Parameters
nc: 3
scales:
  n: [0.33, 0.25, 1024]

# EdgeAnt backbone
# Lightweight Hierarchical Geometric Network
backbone:
  # [from, repeats, module, args]
  - [-1, 1, HGStem, [32, 64]]  # 0-P2/4

  - [-1, 1, Conv, [128,3,2]]
  - [-1, 3, LHGBlock, [64, 128, 3]]  # stage 1

  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, LHGBlock, [128, 256, 3]]   # stage 2

  - [-1, 1, Conv, [512, 3, 2]]  # 5-P3/16
  - [-1, 6, LHGBlock, [256, 512, 3]]  # stage 3

  # Suppression of model channels reduces small target feature loss
  - [-1, 1, Conv, [512, 3, 2]]  # 7-P4/32
  - [-1, 3, LHGBlock, [256, 512, 3]]  # stage 4

head:

  # Enhancement Layer
  # Here the TSRblock is placed in the last layer of the enhancement layer
  - [4, 1, Conv, [256]]  # 9-P3/8
  - [6, 1, Conv, [256]]  # 10-P4/16
  - [8, 1, TSRBlock, [256]]  # 11-P5/32

  # Heterogeneous Bidirectional Feature Pyramid Network
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 12 P5->P4
  - [[-1, 10], 1, Bi_FPN, []] # 13
  # Heterogeneous Block
  - [-1, 3, HetBlock, [256]] # 14-P4/16

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 15 P4->P3
  - [[-1, 9], 1, Bi_FPN, []] # 16
  - [-1, 3, HetBlock, [256]] # 17-P3/8

  - [-1, 1, Conv, [256, 3, 2]] # 18 P3->P4
  # Three-feature fusion
  - [[-1, 10, 14], 1, Bi_FPN, []] # 19
  - [-1, 3, HetBlock, [512]] # 20-P4/16

  - [-1, 1, Conv, [256, 3, 2]] # 21 P4->P5
  - [[-1, 11], 1, Bi_FPN, []] # 22
  - [-1, 3, HetBlock, [512]] # 23-P5/32

  - [[17, 20, 23], 1, Detect, [nc]]  # Detect(P3, P4, P5)
